app/controllers/posts_controller.rb

  def create
    #render plain: params[:post].inspect
    @post = Post.new(post_params)

    if(@post.save)
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Hello world"], ["created_at", "2020-10-21 12:09:04.706987"], ["updated_at", "2020-10-21 12:09:04.706987"]]

  def update
    @post = Post.find(params[:id])

    if(@post.update(post_params))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?